src/cf/DataProcessors/УчетРабочегоВремениИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УчетРабочегоВремениИнтеграции</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Catalogs/ВнешниеСистемыТикетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемыТикетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазовыйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСистемТикетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/УчетРабочегоВремениИнтеграции/Ext/ObjectModule.bsl
// https://its.1c.ru/db/v8std#content:455:hdoc
//1.5. Шаблон оформления разделов для модулей объектов, менеджеров, наборов записей, обработок, отчетов и т.п.:
//    Раздел «Программный интерфейс» содержит экспортные процедуры и функции, предназначенные для использования в других модулях конфигурации или другими программами (например, через внешнее соединение). Не следует в этот раздел помещать экспортные функции и процедуры, которые предназначены для вызова исключительно из модулей самого объекта, его форм и команд. Например, процедуры заполнения табличной части документа, которые вызываются из обработки заполнения в модуле объекта и из формы документа в обработчике команды формы не являются программным интерфейсом модуля объекта, т.к. вызываются только в самом модуле и из форм этого же объекта. Их следует размещать в разделе «Служебные процедуры и функции».
//    Раздел «Обработчики событий» содержит обработчики событий модуля объекта (ПриЗаписи, ПриПроведении и др.)
//    Раздел «Служебный программный интерфейс» имеет такое же предназначение, как и в общих модулях.
//    Раздел «Служебные процедуры и функции» имеет такое же предназначение, как и в общих модулях.

////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля> 
// -<Описание модуля>
//
// Например:
// Клиентские процедуры и функции общего назначения:
// - для работы со списками в формах;
// - для работы с журналом регистрации;
// - для обработки действий пользователя в процессе редактирования
//   многострочного текста, например комментария в документах;
// - прочее.
//
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс
// Должна вернуть все записи таймлогов в единой таблице + информацию о том, какие тикет системы не удалось опросить.
Функция СобратьТаймлогиНаДату(Дата, Знач ОпрашиваемыеТикетСистемы = Неопределено) Экспорт
	Если ОпрашиваемыеТикетСистемы = Неопределено Тогда
		ОпрашиваемыеТикетСистемы = ТикетСистемыКромеАрхивных();
	КонецЕсли;
	
	НеОтветившиеСистемы = Новый Массив;
	Таймлоги = УчетРабочегоВремени.ИнициализироватьТаблицуТаймлогов();
	Для Каждого ТикетСистема из ОпрашиваемыеТикетСистемы Цикл 
		ТаймлогиТикетСистемы = ОбработкаТаймлоговТикетСистемы(ТикетСистема);
		РезультатЗапроса = ТаймлогиТикетСистемы.СобратьТаймлогиНаДату(Дата);
		Если ТипЗнч(РезультатЗапроса) = Тип("ТаблицаЗначений") Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатЗапроса, Таймлоги);
		Иначе
			НеОтветившиеСистемы.Добавить(ТикетСистема);
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
				"УчетРабочегоВремени.ПолучениеТаймлогов",
				УровеньЖурналаРегистрации.Предупреждение,
				,
				,
				РезультатЗапроса
			);
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура("Таймлоги, НеОтветившиеСистемы", Таймлоги, НеОтветившиеСистемы);
	Возврат Результат;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти // ОбработчикиСобытий

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции
Функция ТикетСистемыКромеАрхивных()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВнешниеСистемыТикетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВнешниеСистемыТикетов КАК ВнешниеСистемыТикетов
	|ГДЕ
	|	НЕ ВнешниеСистемыТикетов.Архивная"
	;
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат Результат;
КонецФункции

Функция ОбработкаТаймлоговТикетСистемы(ТикетСистема)
	ОбработкаТаймлоговТикетСистемы = НовыйОбработкаТаймлоговТикетСистемы(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТикетСистема, "ТипСистемы"));
	ОбработкаТаймлоговТикетСистемы.Инициализировать(ТикетСистема);
	Возврат ОбработкаТаймлоговТикетСистемы;
КонецФункции                              

Функция НовыйОбработкаТаймлоговТикетСистемы(ТипСистемы)
	Если ТипСистемы = Справочники.ТипыСистемТикетов.ЛокальныйУчет Тогда 
		Возврат Обработки.ТаймлогиЛокальныйУчет.Создать();
	ИначеЕсли ТипСистемы = Справочники.ТипыСистемТикетов.GitLab Тогда 
		Возврат Обработки.ТаймлогиGitlab.Создать();
	Иначе
		ВызватьИсключение СтрШаблон("Для типа <%1> обработчик чтения таймлогов не определен", ТипСистемы);
	КонецЕсли;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
